;Да се дефинира функция add(x, y), която сумира x и y.
(define (add x y)
    (+ x y)
)

;Да се дефинира предикат even?(n), проверяващ дали n е четно число и предикат odd?(n), проверяващ дали n е нечетно число.
(define (even n)
    (= 0 (remainder n 2))
)
(define (odd n)
    (not (even n))
)

;Да се дефинира функцията signum(x), която връща -1, 0 или 1 в зависимост от това, дали x е отрицателно, нула или положително число.
(define (signum x)
    (cond
        ((> x 0) 1)
        ((= x 0) 0)
        ((< x 0) -1)
    )
)

;Да се дефинира функцията factorial(n), пресмятаща n!.
(define (fact n)
    (if (<= n 1)
        1
        (* n (fact (- n 1)))
    )
)

;Да се дефинира функция sum(start, end), която намира сумата на числата в интервала [start, end].

;Да се дефинира функция expt(x, n), която пресмята xn.

;Да се дефинира функция fast-expt(x, n), която пресмята xn, използвайки следното свойство:

;Ако n е четно, то xn = (x(n/2))2.
