12/28:
accumulate работи правилно само с асоциативни операции,
и то при данни линейно отляво надясно.
Тоест палиндроми, string-reverse, etc не могат да се решат с accumulate
(нужен е random access).

Как да реализираме accumulate с 6 параметъра от accumulate с 5 параметъра?
-без термове (id)
-само чрез операцията да симулираме терма?

(accumulate or ...) -> breaks, or is not unary but a special form!
Define a lambda instead!

За да може функциите да прихващат контекст, имат указател към среда.
Така те в различен контекст дават различни резултати и затварят различни
променливи. Това се нарича closure.



